#### Terraform Format and Style ``
#### Terraform Initialization `success`
#### Terraform Validation Success! The configuration is valid.


#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.proxmox_import.proxmox_virtual_environment_download_file.imported_disk["flatcar-proxmox2.qcow2"] will be created
  + resource "proxmox_virtual_environment_download_file" "imported_disk" {
      + content_type        = "import"
      + datastore_id        = "local"
      + file_name           = "flatcar-proxmox2.qcow2"
      + id                  = (known after apply)
      + node_name           = "SA-MS01"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://stable.release.flatcar-linux.net/amd64-usr/current/flatcar_production_proxmoxve_image.img"
      + verify              = true
    }

  # module.proxmox_template.proxmox_virtual_environment_vm.custom_templates["flatcar-template"] will be created
  + resource "proxmox_virtual_environment_vm" "custom_templates" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = [
          + "scsi0",
          + "ide0",
          + "net0",
        ]
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Default config for vm"
      + hotplug                              = (known after apply)
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + machine                              = "pc"
      + migrate                              = false
      + name                                 = "flatcar-template"
      + network_device                       = [
          + {
              + bridge      = "vmbr0"
              + enabled     = true
              + firewall    = false
              + mac_address = (known after apply)
              + model       = "e1000e"
              + mtu         = 0
              + queues      = 0
              + rate_limit  = 0
              + vlan_id     = 0
            },
        ]
      + network_interface_names              = (known after apply)
      + node_name                            = "SA-MS01"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-pci"
      + stop_on_destroy                      = true
      + tablet_device                        = true
      + template                             = true
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = (known after apply)

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + import_from       = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 20
          + ssd               = false
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.proxmox_vm.proxmox_virtual_environment_vm.iso_vms["flatcar-template2"] will be created
  + resource "proxmox_virtual_environment_vm" "iso_vms" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = [
          + "scsi0",
          + "ide0",
          + "net0",
        ]
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Default config for vm"
      + hotplug                              = (known after apply)
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + machine                              = "pc"
      + migrate                              = false
      + name                                 = "flatcar-template2"
      + network_device                       = [
          + {
              + bridge      = "vmbr0"
              + enabled     = true
              + firewall    = false
              + mac_address = (known after apply)
              + model       = "e1000e"
              + mtu         = 0
              + queues      = 0
              + rate_limit  = 0
              + vlan_id     = 0
            },
        ]
      + network_interface_names              = (known after apply)
      + node_name                            = "SA-MS01"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-pci"
      + started                              = true
      + stop_on_destroy                      = true
      + tablet_device                        = true
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = (known after apply)

      + clone {
          + full    = true
          + retries = 1
          + vm_id   = (known after apply)
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v2-AES"
          + units      = (known after apply)
        }

      + memory {
          + dedicated      = 4096
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @chloefitzgerald04, Action: `pull_request`, Workflow: `Pull request- plan`*